[
    {
        "productname": "Murray MT100 42 in. 13.5 HP 500cc E1350 Series Briggs and Stratton Engine 6-Speed Manual Gas Riding Lawn Tractor Mower",
        "price": 1799,
        "details": "13.5 HP 500 cc Briggs and Stratton engine, 6-speed manual transmission, 42 in. cut with twin blades and anti-scalp wheels",
        "specifications": "42 in. cut, 13.5 HP, 500cc, E1350 Series Briggs and Stratton Engine, 6-speed manual transmission, gas-powered, riding lawn tractor mower"
    },
    {
        "productname": "Cub Cadet XT1 Enduro LT 46 in. 22 HP V-Twin Kohler 7000 Series Engine Hydrostatic Drive Gas Riding Lawn Tractor",
        "price": 2349,
        "details": "Smooth Tuff Torq TL-200 Hydrostatic Transmission 46 in. Deck with Twin Blade System with S-Blade Hole Pattern",
        "specifications": "22 HP 725 cc Kohler 7000 Series Twin Cylinder Engine"
    },
    {
        "productname": "Murray 21 in. 140 cc Briggs and Stratton Walk Behind Gas Push Lawn Mower with Height Adjustment and Prime 'N Pull Start",
        "price": 299,
        "details": "140cc Briggs and Stratton engine with Prime N Pull start\n11 in high rear wheels for optimal maneuverability on all terrain\n6-position, 2-point front and rear height adjustment",
        "specifications": "21 in. lawn mower\nGas-powered\nPush mower\n140 cc engine\nPrime 'N Pull start\n11 in high rear wheels\n6-position, 2-point height adjustment"
    },
    {
        "productname": "Yard Machines 20 in. 125 cc OHV Briggs and Stratton Gas Walk Behind Push Mower",
        "price": 282,
        "details": "Powered by 125 cc Briggs & Stratton 300e series engine, 20 in. cutting deck with side discharge covers a wide range, Fully assembled in the box - just unfold the handle",
        "specifications": "20 in. cutting deck, 125 cc OHV Briggs and Stratton Gas engine"
    },
    {
        "productname": "Powercare 20 oz. SAE 30 Tractor and Lawn Mower Engine Oil",
        "price": 2030,
        "details": "For 4-cycle engines, SAE-30, 20 oz. bottle",
        "specifications": "Model # AP20300A, Store SKU # 460478"
    }
]