[
    {
        "productname": "Trucker Hat",
        "price": 38,
        "details": "Unissex hats from lululemon athletica",
        "specifications": "Color: Bone, Sizes: S/M (not available), L/XL",
        "url": "https://shop.lululemon.com/p/hats/Trucker-Hat/_/prod11020363?color=27597"
    },
    {
        "productname": "Delaney Marble Floor Lamp",
        "price": 399,
        "details": "Contract Grade | Bestseller",
        "specifications": "Earn up to 10% in rewards ¹ today with a new Pottery Barn credit card. Learn More",
        "url": "https://www.potterybarn.com/products/delaney-marble-floor-lamp/?pkey=cfloor-lamps"
    },
    {
        "productname": "Garmin Vivoactive 5 GPS Smartwatch",
        "price": 34999,
        "details": "Designed with a bright, colorful AMOLED display, get a more complete picture of your health, thanks to the battery life of up to 11 days in smartwatch mode. BodyBattery energy monitoring helps you understand when you’re charged up or need to rest, with even more personalized insights based on sleep, naps, stress levels, workouts, and more. Get a sleep score and personalized sleep coaching for how much sleep you need — and get tips on how to improve plus key metrics such as HRV status to better understand your health. Find new ways to keep your body moving with more than 30 built-in indoor and GPS sports apps, including apps for active wheelchair users — plus advanced training features to keep you going strong. When paired to your smartphone, vívoactive 5 makes it easy to receive texts, emails, and other smart notifications right from your wrist. Plus, enjoy connectivity features such as music storage, GarminPay contactless payments, and more.",
        "specifications": "Bright AMOLED display, up to 11 days of battery life, BodyBattery energy monitoring, sleep score and coaching, wrist-based heart rate, morning report, fitness age, stress tracking, menstrual cycle and pregnancy tracking, meditation, advanced training features, preloaded workouts, wheelchair mode, automatic nap detection, battery energy monitoring, water rating: 5 ATM, GPS, GLONASS, and Galileo satellite reception, barometric altimeter, compass, accelerometer, thermometer, ambient light sensor, Garmin Pay contactless payments, smart notifications, music storage, and safety and tracking features.",
        "url": "https://www.bjs.com/product/garmin-vivoactive-5-gps-smartwatch/3000000000005027783"
    },
    {
        "productname": "Murray MT100 42 in. 13.5 HP 500cc E1350 Series Briggs and Stratton Engine 6-Speed Manual Gas Riding Lawn Tractor Mower",
        "price": 1799,
        "details": "13.5 HP 500 cc Briggs and Stratton engine, 6-speed manual transmission, 42 in. cut with twin blades and anti-scalp wheels",
        "specifications": "Model # MYT4213500, Store SKU # 1008100443",
        "url": "https://www.homedepot.com/p/Murray-MT100-42-in-13-5-HP-500cc-E1350-Series-Briggs-and-Stratton-Engine-6-Speed-Manual-Gas-Riding-Lawn-Tractor-Mower-MYT4213500/317475333"
    },
    {
        "productname": "Murray 21 in. 140 cc Briggs and Stratton Walk Behind Gas Push Lawn Mower with Height Adjustment and Prime 'N Pull Start",
        "price": 299,
        "details": "140cc Briggs and Stratton engine with Prime N Pull start, 11 in high rear wheels for optimal maneuverability on all terrain, 6-position, 2-point front and rear height adjustment",
        "specifications": "21 in. lawn mower, gas-powered, push mower, walk-behind mower, 140 cc engine, Briggs and Stratton engine, Prime N Pull start, 11 in high rear wheels, 6-position height adjustment, 2-point height adjustment, manual push mower",
        "url": "https://www.homedepot.com/p/Murray-21-in-140-cc-Briggs-and-Stratton-Walk-Behind-Gas-Push-Lawn-Mower-with-Height-Adjustment-and-Prime-N-Pull-Start-MNA152702/314250724"
    },
    {
        "productname": "Powercare 20 oz. SAE 30 Tractor and Lawn Mower Engine Oil",
        "price": 2030,
        "details": "For 4-cycle engines, SAE-30, 20 oz. bottle",
        "specifications": "Model # AP20300A, Store SKU # 460478",
        "url": "https://www.homedepot.com/p/Powercare-20-oz-SAE-30-Tractor-and-Lawn-Mower-Engine-Oil-AP20300A/202564515"
    },
    {
        "productname": "Trucker Hat",
        "price": 38.0,
        "details": "Unixex hats from lululemon athletica",
        "specifications": "Color: Bone, Sizes: S/M (not available), L/XL",
        "url": "https://shop.lululemon.com/p/hats/Trucker-Hat/_/prod11020363?color=27597"
    },
    {
        "productname": "Delaney Marble Floor Lamp",
        "price": 399.0,
        "details": "Contract Grade Bestseller",
        "specifications": "Earn up to 10% in rewards today with a new Pottery Barn credit card. Learn More [+]Feedback Customer Service Contact Us Track Your Order Returns & Exchanges Shipping Information International Orders Email Preferences x Help Topics Give Us Feedback About Us Our Story Careers Press Influencers Find a Store Business to Business Overview Trade Contract Corporate Gifting Design Services Free Interior Design Room Planner Resources Pottery Barn Credit Card Pay Bill Online View Online Catalog Request a Catalog Address Change Gift Cards Do Not Sell Or Share My Personal Information Shopping App Join our VIP list for inspiration, new arrivals & more. Join our VIP list for inspiration, new arrivals & more. California residents, please see the Financial Incentive Terms for terms. Do Not Sell My Personal Information Follow Us Instagram Facebook Pinterest YouTube *Some exclusions apply. Click here for details",
        "availability": "Bestseller",
        "url": "https://www.potterybarn.com/products/delaney-marble-floor-lamp/?pkey=cfloor-lamps"
    },
    {
        "productname": "Garmin Vivoactive 5 GPS Smartwatch",
        "price": 349.99,
        "details": "Know the real you with the Vivoactive 5 smartwatch, the ultimate on-wrist coach designed to support your goals — whatever they may be. Featuring a bright, colorful AMOLED display and up to 11 days of battery life, this GPS smartwatch is purpose-built with essential health and fitness features to help you better understand your body. BodyBattery energy monitoring helps you keep your energy levels in check with personalized insights based on sleep, naps, stress, workouts, and more. Improve the quality of your sleep with personalized sleep coaching and nap detection plus even more details such as HRV status (data presented is intended to be a close estimation of metrics tracked). During the day, switch up your activities with more than 30 built-in sports apps — including apps for active wheelchair users — plus advanced training features to keep you going strong. When paired to your smartphone, vívoactive 5 makes it easy to receive texts, emails, and other smart notifications right from your wrist. Plus, enjoy connectivity features such as music storage, GarminPay contactless payments, and more.",
        "specifications": "Designed with a bright, colorful AMOLED display, get a more complete picture of your health, thanks to the battery life of up to 11 days in smartwatch mode BodyBattery energy monitoring helps you understand when you’re charged up or need to rest, with even more personalized insights based on sleep, naps, stress levels, workouts, and more Get a sleep score and personalized sleep coaching for how much sleep you need — and get tips on how to improve plus key metrics such as HRV status to better understand your health Find new ways to keep your body moving with more than 30 built-in indoor and GPS sports apps, including walking, running, cycling, HIIT, swimming, golf and more Wheelchair mode tracks push — rather than steps — and includes push and handcycle activities with preloaded workouts for strength, cardio, HIIT, Pilates, and yoga, challenges specific to wheelchair users, and more Automatic nap detection and nap logging track your nap length during the day, providing personalized insights on how it affects your body Battery energy monitoring and more Know your body better with extensive health monitoring features, including wrist-based heart rate, morning report, fitness age, stress tracking, menstrual cycle and pregnancy tracking, meditation, and more Take on any fitness journey with advanced training features such as workout benefits — which help you understand how each workout affects your body — and recovery time to know how long your body needs to recover and more Use preloaded workouts that include cardio, yoga, strength, HIIT, and Pilates; create your own in the Garmin Connect smartphone app, or try Garmin Coach free adaptive training plans to help you prepare for your next running challenge Includes Vivoactive 5, charging/data cable, documentation",
        "url": "https://www.bjs.com/product/garmin-vivoactive-5-gps-smartwatch/3000000000005027783"
    },
    {
        "productname": "Murray MT100 42 in. 13.5 HP 500cc E1350 Series Briggs and Stratton Engine 6-Speed Manual Gas Riding Lawn Tractor Mower",
        "price": 1799.0,
        "details": "13.5 HP 500 cc Briggs and Stratton engine, 6-speed manual transmission, 42 in. cut with twin blades and anti-scalp wheels",
        "specifications": "Briggs and Stratton Engine, 6-speed manual transmission, 42 in. cut with twin blades and anti-scalp wheels, 13.5 HP 500cc E1350 Series Engine",
        "url": "https://www.homedepot.com/p/Murray-MT100-42-in-13-5-HP-500cc-E1350-Series-Briggs-and-Stratton-Engine-6-Speed-Manual-Gas-Riding-Lawn-Tractor-Mower-MYT4213500/317475333"
    },
    {
        "productname": "Cub Cadet XT1 Enduro LT 46 in. 22 HP V-Twin Kohler 7000 Series Engine Hydrostatic Drive Gas Riding Lawn Tractor",
        "price": 2349.0,
        "details": "22 HP 725 cc Kohler 7000 Series Twin Cylinder Engine, Smooth Tuff Torq TL-200 Hydrostatic Transmission, 46 in. Deck with Twin Blade System with S-Blade Hole Pattern",
        "specifications": "Cub Cadet XT1 Enduro LT, 46 in. deck, 22 HP, V-Twin Kohler 7000 Series Engine, Hydrostatic Drive, Gas Riding Lawn Tractor, Tuff Torq TL-200 Transmission",
        "url": "https://www.homedepot.com/p/Cub-Cadet-XT1-Enduro-LT-46-in-22-HP-V-Twin-Kohler-7000-Series-Engine-Hydrostatic-Drive-Gas-Riding-Lawn-Tractor-LT46/318885541"
    },
    {
        "productname": "Murray 21 in. 140 cc Briggs and Stratton Walk Behind Gas Push Lawn Mower with Height Adjustment and Prime 'N Pull Start",
        "price": 299.0,
        "details": "140cc Briggs and Stratton engine with Prime N Pull start\n11 in high rear wheels for optimal maneuverability on all terrain\n6-position, 2-point front and rear height adjustment",
        "specifications": "21 in.\n140 cc Briggs and Stratton engine\nWalk-behind gas push lawn mower\nHeight adjustment\nPrime 'N Pull Start\n384 Questions & Answers\n37\nHover Image to Zoom\nShare\nPrint\n$299.00\nPay $274.00 after $25 OFF your total qualifying purchase upon opening a new card.\nApply for a Home Depot Consumer Card\n140cc Briggs and Stratton engine with Prime N Pull start\n11 in high rear wheels for optimal maneuverability on all terrain\n6-position, 2-point front and rear height adjustment",
        "url": "https://www.homedepot.com/p/Murray-21-in-140-cc-Briggs-and-Stratton-Walk-Behind-Gas-Push-Lawn-Mower-with-Height-Adjustment-and-Prime-N-Pull-Start-MNA152702/314250724"
    },
    {
        "productname": "Yard Machines 20 in. 125 cc OHV Briggs and Stratton Gas Walk Behind Push Mower",
        "price": 282.99,
        "details": "Powered by 125 cc Briggs & Stratton 300e series engine, 20 in. cutting deck with side discharge covers a wide range, Fully assembled in the box - just unfold the handle",
        "specificatons": "20 in. cutting deck, 125 cc Briggs & Stratton 300e series engine",
        "url": "https://www.homedepot.com/p/Yard-Machines-20-in-125-cc-OHV-Briggs-and-Stratton-Gas-Walk-Behind-Push-Mower-11A-02BT729/300193832"
    },
    {
        "productname": "Powercare 20 oz. SAE 30 Tractor and Lawn Mower Engine Oil",
        "price": 17.97,
        "details": "For 4-cycle engines, SAE-30, 20 oz. bottle",
        "specifications": "Model # AP20300A, Store SKU # 460478",
        "url": "https://www.homedepot.com/p/Powercare-20-oz-SAE-30-Tractor-and-Lawn-Mower-Engine-Oil-AP20300A/202564515"
    }
]